In [1]:
import pandas as pd

In [8]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "C" : [21,22,23,24],
    }
)

In [9]:
var1

   A   B
0  1  11
1  2  12
2  3  13
3  4  14

In [10]:
var2

   A   C
0  1  21
1  2  22
2  3  23
3  4  24

In [11]:
pd.merge(var1,var2, on= "A")

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
3  4  14  24

In [12]:
pd.merge(var2,var1, on= "A")

   A   C   B
0  1  21  11
1  2  22  12
2  3  23  13
3  4  24  14

In [17]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2,3,5],
        "C" : [21,22,23,24],
    }
)
pd.merge(var1,var2, on= "A")

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23

In [22]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2,3,5],
        "C" : [21,22,23,24],
    }
)

In [23]:
pd.merge(var1,var2, how="left")

   A   B     C
0  1  11  21.0
1  2  12  22.0
2  3  13  23.0
3  4  14   NaN

In [24]:
pd.merge(var1,var2, how="right")

   A     B   C
0  1  11.0  21
1  2  12.0  22
2  3  13.0  23
3  5   NaN  24

In [25]:
pd.merge(var1,var2, how="outer")

   A     B     C
0  1  11.0  21.0
1  2  12.0  22.0
2  3  13.0  23.0
3  4  14.0   NaN
4  5   NaN  24.0

In [26]:
pd.merge(var1,var2, how="outer" , indicator=True)

   A     B     C      _merge
0  1  11.0  21.0        both
1  2  12.0  22.0        both
2  3  13.0  23.0        both
3  4  14.0   NaN   left_only
4  5   NaN  24.0  right_only

In [32]:
var1 = pd.DataFrame(
    {
        "A" : [1,2,3,4],
        "B" : [11,12,13,14],
    }
)
var2= pd.DataFrame(
    {
        "A" : [1,2,3,5],
        "B" : [21,22,23,24],
    }
)
pd.merge(var1,var2,left_index=True,right_index=True,suffixes =["_Data","_Value"] )

   A_Data  B_Data  A_Value  B_Value
0       1      11        1       21
1       2      12        2       22
2       3      13        3       23
3       4      14        5       24